project/atropos-go/etcd_concurrent_read-master/master/e1/output/without_expensive_read/cheap_read.log
bench with linearizable range
 0 / 1000 B                                                                                                                                                  !   0.00%INFO: 2023/06/09 04:20:33 ccResolverWrapper: sending new addresses to cc: [{localhost:2379 0  <nil>}]
INFO: 2023/06/09 04:20:33 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
INFO: 2023/06/09 04:20:33 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
 1000 / 1000 Boooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 9s

Summary:
  Total:	9.9911 secs.
  Slowest:	0.0101 secs.
  Fastest:	0.0002 secs.
  Average:	0.0005 secs.
  Stddev:	0.0006 secs.
  Requests/sec:	100.0894

Response time histogram:
  0.0002 [1]	|
  0.0012 [920]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.0022 [62]	|∎∎
  0.0031 [11]	|
  0.0041 [5]	|
  0.0051 [0]	|
  0.0061 [0]	|
  0.0071 [0]	|
  0.0081 [0]	|
  0.0091 [0]	|
  0.0101 [1]	|

Latency distribution:
  10% in 0.0002 secs.
  25% in 0.0003 secs.
  50% in 0.0003 secs.
  75% in 0.0004 secs.
  90% in 0.0007 secs.
  95% in 0.0016 secs.
  99% in 0.0029 secs.
  99.9% in 0.0101 secs.